# Напишите функцию f, которая на вход принимает два числа a и b, 
# и возводит число a в целую степень b с помощью рекурсии.

# Функция не должна ничего выводить, только возвращать значение.

a=2
b=-2

# def f (a, b):
#     if (b == 1):
#         return (a)
#     return (a*f(a, b-1))

# print(f(a,b))


